# GetRibbonPanels Method (Tab) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIControlledApplication..::..GetRibbonPanels Method (Tab)
UIControlledApplication Class See Also
---
Get all the custom Panels on a designated standard Revit tab.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual List<RibbonPanel> GetRibbonPanels(
	Tab tab
)
```

Visual Basic
---
```text
Public Overridable Function GetRibbonPanels ( _
	tab As Tab _
) As List(Of RibbonPanel)
```

Visual C++
---
```text
public:
virtual List<RibbonPanel^>^ GetRibbonPanels(
	Tab tab
)
```

# ### Parameters
tab
    Type: Autodesk.Revit.UI..::..TabThe tab on which the panels are located.
# Remarks
Built-in panels will not be included. This method is not supported in Macros.
# See Also
UIControlledApplication Class
GetRibbonPanels Overload
Autodesk.Revit.UI Namespace